bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA16U2.xml
<?xml version="1.0" encoding="UTF-8"?>
<target-description-file>
    <variants>
        <variant ordercode="ATmega16U2-AU" speedmax="16000000" tempmin="-40" tempmax="85" vccmin="2.7" vccmax="5.5"
                 package="TQFP32" pinout="QUAD"/>
        <variant ordercode="ATmega16U2-MU" speedmax="16000000" tempmin="-40" tempmax="85" vccmin="2.7" vccmax="5.5"
                 package="QFN32" pinout="QUAD"/>
    </variants>
    <device name="ATmega16U2" architecture="AVR8" family="megaAVR">
        <address-spaces>
            <address-space endianness="little" name="prog" id="prog" start="0x0000" size="0x4000">
                <memory-segment start="0x0000" size="0x4000" type="flash" rw="RW" exec="1" name="FLASH"
                                pagesize="0x80"/>
                <memory-segment start="0x3e00" size="0x0200" type="flash" rw="RW" exec="1" name="BOOT_SECTION_1"
                                pagesize="0x80"/>
                <memory-segment start="0x3c00" size="0x0400" type="flash" rw="RW" exec="1" name="BOOT_SECTION_2"
                                pagesize="0x80"/>
                <memory-segment start="0x3800" size="0x0800" type="flash" rw="RW" exec="1" name="BOOT_SECTION_3"
                                pagesize="0x80"/>
                <memory-segment start="0x3000" size="0x1000" type="flash" rw="RW" exec="1" name="BOOT_SECTION_4"
                                pagesize="0x80"/>
            </address-space>
            <address-space endianness="little" name="signatures" id="signatures" start="0" size="3">
                <memory-segment start="0" size="3" type="signatures" rw="R" exec="0" name="SIGNATURES"/>
            </address-space>
            <address-space endianness="little" name="fuses" id="fuses" start="0" size="0x0003">
                <memory-segment start="0" size="0x0003" type="fuses" rw="RW" exec="0" name="FUSES"/>
            </address-space>
            <address-space endianness="little" name="lockbits" id="lockbits" start="0" size="0x0001">
                <memory-segment start="0" size="0x0001" type="lockbits" rw="RW" exec="0" name="LOCKBITS"/>
            </address-space>
            <address-space endianness="little" name="data" id="data" start="0x0000" size="0x0300">
                <memory-segment external="false" type="regs" size="0x0020" start="0x0000" name="REGISTERS"/>
                <memory-segment name="MAPPED_IO" start="0x0020" size="0x00e0" type="io" external="false"/>
                <memory-segment name="IRAM" start="0x0100" size="0x0200" type="ram" external="false"/>
            </address-space>
            <address-space endianness="little" name="eeprom" id="eeprom" start="0x0000" size="0x0200">
                <memory-segment start="0x0000" size="0x0200" type="eeprom" rw="RW" exec="0" name="EEPROM"
                                pagesize="0x04"/>
            </address-space>
            <address-space size="0x40" start="0x00" endianness="little" name="io" id="io"/>
            <address-space endianness="little" name="osccal" id="osccal" start="0" size="1">
                <memory-segment start="0" size="1" type="osccal" rw="R" exec="0" name="OSCCAL"/>
            </address-space>
        </address-spaces>
        <peripherals>
            <module name="PORT">
                <instance name="PORTB" caption="I/O Port">
                    <register-group name="PORTB" name-in-module="PORTB" offset="0x00" address-space="data"
                                    caption="I/O Port"/>
                    <signals>
                        <signal group="P" function="default" pad="PB0" index="0"/>
                        <signal group="P" function="default" pad="PB1" index="1"/>
                        <signal group="P" function="default" pad="PB2" index="2"/>
                        <signal group="P" function="default" pad="PB3" index="3"/>
                        <signal group="P" function="default" pad="PB4" index="4"/>
                        <signal group="P" function="default" pad="PB5" index="5"/>
                        <signal group="P" function="default" pad="PB6" index="6"/>
                        <signal group="P" function="default" pad="PB7" index="7"/>
                    </signals>
                </instance>
                <instance name="PORTD" caption="I/O Port">
                    <register-group name="PORTD" name-in-module="PORTD" offset="0x00" address-space="data"
                                    caption="I/O Port"/>
                    <signals>
                        <signal group="P" function="default" pad="PD0" index="0"/>
                        <signal group="P" function="default" pad="PD1" index="1"/>
                        <signal group="P" function="default" pad="PD2" index="2"/>
                        <signal group="P" function="default" pad="PD3" index="3"/>
                        <signal group="P" function="default" pad="PD4" index="4"/>
                        <signal group="P" function="default" pad="PD5" index="5"/>
                        <signal group="P" function="default" pad="PD6" index="6"/>
                        <signal group="P" function="default" pad="PD7" index="7"/>
                    </signals>
                </instance>
                <instance name="PORTC" caption="I/O Port">
                    <register-group name="PORTC" name-in-module="PORTC" offset="0x00" address-space="data"
                                    caption="I/O Port"/>
                    <signals>
                        <signal group="P" function="default" pad="PC0" index="0"/>
                        <signal group="P" function="default" pad="PC1" index="1"/>
                        <signal group="P" function="default" pad="PC2" index="2"/>
                        <signal group="P" function="default" pad="PC3" index="3"/>
                        <signal group="P" function="default" pad="PC4" index="4"/>
                        <signal group="P" function="default" pad="PC5" index="5"/>
                        <signal group="P" function="default" pad="PC6" index="6"/>
                        <signal group="P" function="default" pad="PC7" index="7"/>
                    </signals>
                </instance>
            </module>
            <module name="SPI">
                <instance name="SPI" caption="Serial Peripheral Interface">
                    <register-group name="SPI" name-in-module="SPI" offset="0x00" address-space="data"
                                    caption="Serial Peripheral Interface"/>
                    <signals>
                        <signal group="MISO" pad="PB3" function="default"/>
                        <signal group="MOSI" pad="PB2" function="default"/>
                        <signal group="SCLK" pad="PB1" function="default"/>
                        <signal group="SS" pad="PB0" function="default"/>
                    </signals>
                </instance>
            </module>
