bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA16U2.xml
        <module caption="EEPROM" name="EEPROM">
            <register-group caption="EEPROM" name="EEPROM">
                <register caption="EEPROM Address Register Low Bytes" name="EEAR" offset="0x41" size="2" mask="0x0FFF">
                    <bitfield caption="EEPROM Address bits" mask="0x0FFF" name="EEAR"/>
                </register>
                <register caption="EEPROM Data Register" name="EEDR" offset="0x40" size="1" mask="0xFF">
                    <bitfield caption="EEPROM Data bits" mask="0xFF" name="EEDR"/>
                </register>
                <register caption="EEPROM Control Register" name="EECR" offset="0x3F" size="1">
                    <bitfield caption="EEPROM Programming Mode Bits" mask="0x30" name="EEPM" values="EEP_MODE"/>
                    <bitfield caption="EEPROM Ready Interrupt Enable" mask="0x08" name="EERIE"/>
                    <bitfield caption="EEPROM Master Write Enable" mask="0x04" name="EEMPE"/>
                    <bitfield caption="EEPROM Write Enable" mask="0x02" name="EEPE"/>
                    <bitfield caption="EEPROM Read Enable" mask="0x01" name="EERE"/>
                </register>
            </register-group>
            <value-group caption="" name="EEP_MODE">
                <value caption="Erase and Write in one operation" name="VAL_0x00" value="0x00"/>
                <value caption="Erase Only" name="VAL_0x01" value="0x01"/>
                <value caption="Write Only" name="VAL_0x02" value="0x02"/>
            </value-group>
        </module>
        <module caption="Timer/Counter, 8-bit" name="TC8">
            <register-group caption="Timer/Counter, 8-bit" name="TC0">
                <register caption="Timer/Counter0 Output Compare Register" name="OCR0B" offset="0x48" size="1"
                          mask="0xFF">
                    <bitfield caption="Timer/Counter0 Output Compare B bits" mask="0xFF" name="OCR0B"/>
                </register>
                <register caption="Timer/Counter0 Output Compare Register" name="OCR0A" offset="0x47" size="1"
                          mask="0xFF">
                    <bitfield caption="Timer/Counter0 Output Compare A bits" mask="0xFF" name="OCR0A"/>
                </register>
                <register caption="Timer/Counter0" name="TCNT0" offset="0x46" size="1" mask="0xFF">
                    <bitfield caption="Timer/Counter0 bits" mask="0xFF" name="TCNT0"/>
                </register>
                <register caption="Timer/Counter Control Register B" name="TCCR0B" offset="0x45" size="1">
                    <bitfield caption="Force Output Compare A" mask="0x80" name="FOC0A"/>
                    <bitfield caption="Force Output Compare B" mask="0x40" name="FOC0B"/>
                    <bitfield caption="" mask="0x08" name="WGM02"/>
                    <bitfield caption="Clock Select" mask="0x07" name="CS0" values="CLK_SEL_3BIT_EXT"/>
                </register>
                <register caption="Timer/Counter  Control Register A" name="TCCR0A" offset="0x44" size="1">
                    <bitfield caption="Compare Output Mode, Phase Correct PWM Mode" mask="0xC0" name="COM0A"/>
                    <bitfield caption="Compare Output Mode, Fast PWm" mask="0x30" name="COM0B"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM0"/>
                </register>
                <register caption="Timer/Counter0 Interrupt Mask Register" name="TIMSK0" offset="0x6E" size="1">
                    <bitfield caption="Timer/Counter0 Output Compare Match B Interrupt Enable" mask="0x04"
                              name="OCIE0B"/>
                    <bitfield caption="Timer/Counter0 Output Compare Match A Interrupt Enable" mask="0x02"
                              name="OCIE0A"/>
                    <bitfield caption="Timer/Counter0 Overflow Interrupt Enable" mask="0x01" name="TOIE0"/>
                </register>
                <register caption="Timer/Counter0 Interrupt Flag register" name="TIFR0" offset="0x35" size="1"
                          ocd-rw="R">
                    <bitfield caption="Timer/Counter0 Output Compare Flag 0B" mask="0x04" name="OCF0B"/>
                    <bitfield caption="Timer/Counter0 Output Compare Flag 0A" mask="0x02" name="OCF0A"/>
                    <bitfield caption="Timer/Counter0 Overflow Flag" mask="0x01" name="TOV0"/>
                </register>
                <register caption="General Timer/Counter Control Register" name="GTCCR" offset="0x43" size="1">
                    <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
                    <bitfield caption="Prescaler Reset Timer/Counter1 and Timer/Counter0" mask="0x01" name="PSRSYNC"/>
                </register>
            </register-group>
            <value-group caption="" name="CLK_SEL_3BIT_EXT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
                <value caption="Running, ExtClk Tn Falling Edge" name="VAL_0x06" value="0x06"/>
                <value caption="Running, ExtClk Tn Rising Edge" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Timer/Counter, 16-bit" name="TC16">
            <register-group caption="Timer/Counter, 16-bit" name="TC1">
                <register caption="Timer/Counter1 Control Register A" name="TCCR1A" offset="0x80" size="1">
                    <bitfield caption="Compare Output Mode 1A, bits" mask="0xC0" name="COM1A"/>
                    <bitfield caption="Compare Output Mode 1B, bits" mask="0x30" name="COM1B"/>
                    <bitfield caption="Compare Output Mode 1C, bits" mask="0x0C" name="COM1C"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM1"/>
                </register>
                <register caption="Timer/Counter1 Control Register B" name="TCCR1B" offset="0x81" size="1">
                    <bitfield caption="Input Capture 1 Noise Canceler" mask="0x80" name="ICNC1"/>
                    <bitfield caption="Input Capture 1 Edge Select" mask="0x40" name="ICES1"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x18" name="WGM1" lsb="2"/>
                    <bitfield caption="Prescaler source of Timer/Counter 1" mask="0x07" name="CS1"
                              values="CLK_SEL_3BIT_EXT"/>
                </register>
                <register caption="Timer/Counter 1 Control Register C" name="TCCR1C" offset="0x82" size="1">
                    <bitfield caption="Force Output Compare 1A" mask="0x80" name="FOC1A"/>
                    <bitfield caption="Force Output Compare 1B" mask="0x40" name="FOC1B"/>
                    <bitfield caption="Force Output Compare 1C" mask="0x20" name="FOC1C"/>
                </register>
                <register caption="Timer/Counter1 Bytes" name="TCNT1" offset="0x84" size="2" mask="0xFFFF">
                    <bitfield caption="Timer/Counter1 bits" mask="0xFFFF" name="TCNT1"/>
                </register>
                <register caption="Timer/Counter1 Output Compare Register A Bytes" name="OCR1A" offset="0x88" size="2"
                          mask="0xFFFF">
                    <bitfield caption="Timer/Counter1 Output Compare A bits" mask="0xFFFF" name="OCR1A"/>
                </register>
                <register caption="Timer/Counter1 Output Compare Register B Bytes" name="OCR1B" offset="0x8A" size="2"
                          mask="0xFFFF">
                    <bitfield caption="Timer/Counter1 Output Compare B bits" mask="0xFFFF" name="OCR1B"/>
                </register>
                <register caption="Timer/Counter1 Output Compare Register C Bytes" name="OCR1C" offset="0x8C" size="2"
                          mask="0xFFFF">
                    <bitfield caption="Timer/Counter1 Output Compare C bits" mask="0xFFFF" name="OCR1C"/>
                </register>
                <register caption="Timer/Counter1 Input Capture Register Bytes" name="ICR1" offset="0x86" size="2"
                          mask="0xFFFF">
                    <bitfield caption="Timer/Counter1 Input Capture bits" mask="0xFFFF" name="ICR1"/>
                </register>
                <register caption="Timer/Counter1 Interrupt Mask Register" name="TIMSK1" offset="0x6F" size="1">
                    <bitfield caption="Timer/Counter1 Input Capture Interrupt Enable" mask="0x20" name="ICIE1"/>
                    <bitfield caption="Timer/Counter1 Output Compare C Match Interrupt Enable" mask="0x08"
                              name="OCIE1C"/>
                    <bitfield caption="Timer/Counter1 Output Compare B Match Interrupt Enable" mask="0x04"
                              name="OCIE1B"/>
                    <bitfield caption="Timer/Counter1 Output Compare A Match Interrupt Enable" mask="0x02"
                              name="OCIE1A"/>
                    <bitfield caption="Timer/Counter1 Overflow Interrupt Enable" mask="0x01" name="TOIE1"/>
                </register>
