bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA16U2.xml
                <register caption="Timer/Counter1 Interrupt Flag register" name="TIFR1" offset="0x36" size="1"
                          ocd-rw="R">
                    <bitfield caption="Input Capture Flag 1" mask="0x20" name="ICF1"/>
                    <bitfield caption="Output Compare Flag 1C" mask="0x08" name="OCF1C"/>
                    <bitfield caption="Output Compare Flag 1B" mask="0x04" name="OCF1B"/>
                    <bitfield caption="Output Compare Flag 1A" mask="0x02" name="OCF1A"/>
                    <bitfield caption="Timer/Counter1 Overflow Flag" mask="0x01" name="TOV1"/>
                </register>
            </register-group>
            <value-group caption="" name="CLK_SEL_3BIT_EXT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
                <value caption="Running, ExtClk Tn Falling Edge" name="VAL_0x06" value="0x06"/>
                <value caption="Running, ExtClk Tn Rising Edge" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Phase Locked Loop" name="PLL">
            <register-group caption="Phase Locked Loop" name="PLL">
                <register caption="PLL Status and Control register" name="PLLCSR" offset="0x49" size="1">
                    <bitfield caption="PLL prescaler Bits" mask="0x1C" name="PLLP" values="PLL_INPUT_PRESCALER"/>
                    <bitfield caption="PLL Enable Bit" mask="0x02" name="PLLE"/>
                    <bitfield caption="PLL Lock Status Bit" mask="0x01" name="PLOCK"/>
                </register>
            </register-group>
            <value-group caption="" name="PLL_INPUT_PRESCALER">
                <value caption="Clock/4" name="VAL_0x03" value="0x03"/>
                <value caption="Clock/8" name="VAL_0x05" value="0x05"/>
            </value-group>
        </module>
        <module caption="USB Device Registers" name="USB_DEVICE">
            <register-group caption="USB Device Registers" name="USB_DEVICE">
                <register caption="USB Software Output Enable register" name="UPOE" offset="0xFB" size="1">
                    <bitfield caption="USB Buffers Direct Drive enable configuration" mask="0xC0" name="UPWE"/>
                    <bitfield caption="USB direct drive values" mask="0x30" name="UPDRV"/>
                    <bitfield caption="D+ Input value" mask="0x02" name="DPI"/>
                    <bitfield caption="D- Input value" mask="0x01" name="DMI"/>
                </register>
                <register caption="USB Endpoint Number Interrupt Register" name="UEINT" offset="0xF4" size="1"
                          mask="0x1F">
                    <bitfield caption="Byte Count bits" mask="0x1F" name="EPINT"/>
                </register>
                <register caption="USB Endpoint Byte Count Register" name="UEBCLX" offset="0xF2" size="1" mask="0xFF"
                          ocd-rw="R">
                    <bitfield caption="Byte Count bits" mask="0xFF" name="BYCT"/>
                </register>
                <register caption="USB Data Endpoint" name="UEDATX" offset="0xF1" size="1" mask="0xFF" ocd-rw="">
                    <bitfield caption="Data bits" mask="0xFF" name="DAT"/>
                </register>
                <register caption="USB Endpoint Interrupt Enable Register" name="UEIENX" offset="0xF0" size="1">
                    <bitfield caption="Flow Error Interrupt Enable Flag" mask="0x80" name="FLERRE"/>
                    <bitfield caption="NAK IN Interrupt Enable Bit" mask="0x40" name="NAKINE"/>
                    <bitfield caption="NAK OUT Interrupt Enable Bit" mask="0x10" name="NAKOUTE"/>
                    <bitfield caption="Received SETUP Interrupt Enable Flag" mask="0x08" name="RXSTPE"/>
                    <bitfield caption="Received OUT Data Interrupt Enable Flag" mask="0x04" name="RXOUTE"/>
                    <bitfield caption="Stalled Interrupt Enable Flag" mask="0x02" name="STALLEDE"/>
                    <bitfield caption="Transmitter Ready Interrupt Enable Flag" mask="0x01" name="TXINE"/>
                </register>
                <register caption="USB Endpoint Status 1 Register" name="UESTA1X" offset="0xEF" size="1" ocd-rw="R">
                    <bitfield caption="Control Direction" mask="0x04" name="CTRLDIR"/>
                    <bitfield caption="Current Bank" mask="0x03" name="CURRBK"/>
                </register>
                <register caption="USB Endpoint Status 0 Register" name="UESTA0X" offset="0xEE" size="1">
                    <bitfield caption="Configuration Status Flag" mask="0x80" name="CFGOK"/>
                    <bitfield caption="Overflow Error Interrupt Flag" mask="0x40" name="OVERFI"/>
                    <bitfield caption="Underflow Error Interrupt Flag" mask="0x20" name="UNDERFI"/>
                    <bitfield caption="Data Toggle Sequencing Flag" mask="0x0C" name="DTSEQ"/>
                    <bitfield caption="Busy Bank Flag" mask="0x03" name="NBUSYBK"/>
                </register>
                <register caption="USB Endpoint Configuration 1 Register" name="UECFG1X" offset="0xED" size="1">
                    <bitfield caption="Endpoint Size Bits" mask="0x70" name="EPSIZE"/>
                    <bitfield caption="Endpoint Bank Bits" mask="0x0C" name="EPBK"/>
                    <bitfield caption="Endpoint Allocation Bit" mask="0x02" name="ALLOC"/>
                </register>
                <register caption="USB Endpoint Configuration 0 Register" name="UECFG0X" offset="0xEC" size="1">
                    <bitfield caption="Endpoint Type Bits" mask="0xC0" name="EPTYPE"/>
                    <bitfield caption="Endpoint Direction Bit" mask="0x01" name="EPDIR"/>
                </register>
